day-9-10-hotwire-rails/app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hellow"], ["completed", 1], ["created_at", "2022-01-01 18:42:52.459626"], ["updated_at", "2022-01-01 18:42:52.459626"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "asdasd"], ["completed", 0], ["updated_at", "2022-01-01 20:18:04.264860"], ["id", 17]]