day1/app/controllers/api/v1/books_controller.rb

INSERT INTO "books" ("title", "author", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lalegül"], ["author", "Ahmet Kaptan"], ["category_id", 1], ["created_at", "2021-12-22 18:28:59.885869"], ["updated_at", "2021-12-22 18:28:59.885869"]]
---
      def create
        @book = Book.create(book_params)

UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Saffron Swords"], ["updated_at", "2021-12-22 18:16:52.092838"], ["id", 92]]
---
      def update
        @book.update(book_params)