day1/app/representers/book_representer.rb

  def as_json
    {
      id: book.id,
      title: book.title,
      category: Category.find(book.id).name,
      data_added: book.created_at
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]