day1/app/representers/books_representer.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def as_json
    books.map do |book|
      {
        id: book.id,
        title: book.title,
        category: Category.find(book.id).name,
        data_added: book.created_at