day-2-jwtAPI-rails/app/controllers/notes_controller.rb

INSERT INTO "notes" ("message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "deneme"], ["user_id", 1], ["created_at", "2021-12-23 16:51:54.046657"], ["updated_at", "2021-12-23 16:51:54.046657"]]
---
  def create
    @note = Note.new(note_params)
    @note.user_id = @user.id

    if @note.save